W7D3/MusicApp/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["email", "asdf@gmail.com"], ["password_digest", "$2a$12$SiWCEsxA5xvdylUKxFRPZeZY/X2ZJJ2ZVhh8wUu97X53ileEAHmAa"], ["session_token", "_-PI6a-tsp4UZqOcgJ_b0Q"]]
---
    def create #signup
        @user = User.new(user_params)
        if @user.save